Reports/ОтчетКонструкторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОтчетКонструкторов</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбросСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение,</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличениеСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Должности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замерщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОтчетКонструкторов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем РабочееВремя;

//ИнформацияОДата структура с полями: КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя
Функция ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках, Период, ИнформацияОДата)
	
	ДанныеВозврата = Новый Структура("Норма, Факт, План, ОписаниеОбъектаТЗ", 0, 0, 0, "");
	
	ВремяПаузы 							= 0;
	ВремяОжидания 						= 0;
	ВремяОжиданияКонструктором 			= 0;
	ВремяПаузыВЧасах					= 0;
	ВремяОжиданияВЧасах 				= 0;
	ВремяОжиданияКонструкторомВЧасах 	= 0;
	
	ТаблицаВыводаОбъектаТЗ.Очистить(); 
	
	НайденыеСтроки = ТаблицаТайминга.НайтиСтроки(Отбор);
	
	МаксимальныйИндекс = НайденыеСтроки.Количество() - 1;
	
	ОжиданиеРаботы = Истина; 
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания",); 
	
	Смещение = 0;

	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = НайденыеСтроки[х - Смещение];
		
		Если СтрокаТайминга.ДатаОкончания < Период.ДатаНачала ИЛИ СтрокаТайминга.ДатаОкончания > Период.ДатаОкончания Тогда
			Продолжить;	
		КонецЕсли;  
		
		НС = ТаблицаВыводаОбъектаТЗ.Добавить();
		НС.ДатаСтрокойН 		= СтрокаТайминга.ДатаСтрокойН;
		НС.ДатаСтрокойК 		= СтрокаТайминга.ДатаСтрокойК;
		НС.ДатаНачала 			= СтрокаТайминга.ДатаНачала;
		НС.Задача 				= СтрокаТайминга.Задача;
		НС.Норма 				= СтрокаТайминга.НормаВремени;
		НС.Стадия 				= СтрокаТайминга.Стадия;
		НС.СтадияНаименование	= СтрокаТайминга.СтадияНаименование;
		НС.ВРаботе 				= СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		НС.ДругиеРаботы			= Истина;
		НС.СтруктураНорма	= Новый Структура("Период, Задача, НормаВремени", НС.ДатаНачала, СтрокаТайминга.Задача, НС.Норма);
	КонецЦикла;
	
	
КонецФункции

Функция СоздатьТаблицуВывода()

	ОписаниеЧисла5_2 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеБулево		= Новый ОписаниеТипов("Булево");
	
	ТаблицаВыводаОбъектаТЗ = Новый ТаблицаЗначений;
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Стадия", 				Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтадияНаименование", 	Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаНачала", 			Новый ОписаниеТипов("Дата"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаСтрокойН",			Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаСтрокойК",			Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Факт", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ФактЧасы", 			ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("План", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Норма", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтруктураНорма",		);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Задача",				);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ВРаботе", 				ОписаниеБулево);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДругиеРаботы",			ОписаниеБулево);

	Возврат ТаблицаВыводаОбъектаТЗ;
	
КонецФункции // СоздатьТаблицуВывода()  ДругиеРаботы

Функция ПолучитьВыходныеДниВПериоде()
	
	ВыходныеДни = Новый Массив;
	
	Отбор = Новый Структура("РабочиеЧасы", 0);
	
	Для каждого х Из омДаты.ПолучитьРабочиеДни(Период.ДатаНачала, Период.ДатаОкончания, Ложь).НайтиСтроки(Отбор) Цикл
		ВыходныеДни.Добавить(х.Дата);
	КонецЦикла;
	
	Возврат ВыходныеДни;
	
КонецФункции // ПолучитьВыходныеДниВПериоде()

#Область Команды
	
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет(РабочееВремя);
КонецПроцедуры

#КонецОбласти                  
#Область ИсполнениеКоманд
	
Процедура СформироватьОтчет(РабочееВремя)

	ПолеВывода.Очистить();
	
	СекундВСутках = 3600 * 24;
	
	МенеджерОтчета = Отчеты.ОтчетКонструктора;
	
	Макет = Отчеты.ОтчетКонструкторов.ПолучитьМакет("Макет");
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Шапка");
	ТекущаяОбласть.Параметры.Заполнить(ЭтаФорма);
	ТекущаяОбласть.Параметры.КалендарныхДней = омДаты.КоличествоРабочихДней(Период.ДатаНачала, Период.ДатаОкончания);	
	ПолеВывода.Вывести(ТекущаяОбласть);
	ПолеВывода.ФиксацияСверху = ПолеВывода.ВысотаТаблицы;
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;
	
	Конструкторы 		= омТабельНаСервере.ПолучитьПоДолжности(Перечисления.Должности.Конструктор);
	
	РабочееВремя 		= омСотрудники.ПолучитьРабочееВремяПользователи(Конструкторы);
	ТаблицаТайминга 	= МенеджерОтчета.ПолучитьТаймингиЗадачКонструктор(Период, Конструкторы).ТайминЗадач;
	
	ОбъектыТЗКонструктора = омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаТайминга, "ОбъектТЗ");
	
	ТаблицаТайминга.Сортировать("ОбъектТЗНаименование, ДатаНачала");
	РаботаПоТабелю = омТабельНаСервере.ПолучитьКоличествоРабочхДнейПоТабелю(Конструкторы, Период.ДатаНачала, Период.ДатаОкончания);
	
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Время);
    ОписаниеВремя = Новый ОписаниеТипов("Дата", , , , ,КвалификаторыДаты);
	
	ТаблицаРабочееВремя = Новый ТаблицаЗначений;
	ТаблицаРабочееВремя.Колонки.Добавить("Пользователь", 				Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаРабочееВремя.Колонки.Добавить("НачалаПерерыва", 				ОписаниеВремя);
	ТаблицаРабочееВремя.Колонки.Добавить("НачалаРабочегоДня", 			ОписаниеВремя);
	ТаблицаРабочееВремя.Колонки.Добавить("ОкончаниеПерерыва", 			ОписаниеВремя);
	ТаблицаРабочееВремя.Колонки.Добавить("ОкончаниеРабочегоДня", 		ОписаниеВремя);
	ТаблицаРабочееВремя.Колонки.Добавить("КоличестивоРабочихЧасовВДне", Новый ОписаниеТипов("Число"));
	
	Для каждого х Из РабочееВремя Цикл
		
		НС = ТаблицаРабочееВремя.Добавить();
		ЗаполнитьЗначенияСвойств(НС, х);
		НС.КоличестивоРабочихЧасовВДне = МенеджерРегистра.КоличествоРабочихЧасовСотрудника(НС)
	
	КонецЦикла;
	
	ВыходныеДни					= ПолучитьВыходныеДниВПериоде();
	ИнформацияОДата = Новый Структура("ВыходныеДни, РабочееВремя", ВыходныеДни, ТаблицаРабочееВремя);
	
	
	ТаблицаВыводаОбъектаТЗ = СоздатьТаблицуВывода();
	
	ТекущаяОбласть 		= Макет.ПолучитьОбласть("Строка");
	
	Для каждого СтрокаТабеля Из РаботаПоТабелю Цикл
		
		ТекущаяОбласть.Параметры.Сотрудник 		= СтрокаТабеля.СотрудникНаименование;
		ТекущаяОбласть.Параметры.РабочихДней 	= СтрокаТабеля.КоличествоДней;
		ПолеВывода.Вывести(ТекущаяОбласть);
		
		
			//Для каждого х Из ТаблицаВыводаОбъектаТЗ Цикл
			//	
			//		ТекущаяОбласть.Параметры.Заполнить(х);
			//		//ТекущаяОбласть.Параметры.СтадияНаименование = СтрокаЗадач.ОбъектТЗНаименование + Символы.Таб + х.СтадияНаименование;
			//		НормаИтого = НормаИтого + х.Норма;
			//		Вработе = Истина;
			//	
			//КонецЦикла;
		
	КонецЦикла;
	
	//ТекущаяОбласть = Макет.ПолучитьОбласть("Итого");
	//ТекущаяОбласть.Параметры.Норма = НормаИтого;
	//ПолеВывода.Вывести(ТекущаяОбласть); 
	
КонецПроцедуры 

#КонецОбласти

#Область СобытияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ГлавныйКонструктор") Тогда
		
		Если Параметры.Свойство("Конструктор") Тогда
			
			Конструктор = Параметры.Конструктор;	
			
		КонецЕсли;
		
	Иначе
		
		Конструктор = ПараметрыСеанса.ТекущийПользователь;	
		
	КонецЕсли;
	
	Период.ДатаОкончания 	= КонецДня(ТекущаяДата());
	Период.ДатаНачала		= НачалоМесяца(ДобавитьМесяц(Период.ДатаОкончания, -1));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
КонецПроцедуры

#КонецОбласти
